### Importando pandas

In [1]:
import pandas as pd

### Importando Database

In [2]:
from sqlalchemy import create_engine

### Criando a conexão

In [3]:
import pymysql
import urllib.parse

# Definir as credenciais
user = 'root'
password = urllib.parse.quote_plus('senai@123')
host = 'localhost'
database = 'schooltracker'

# Criar URL de conexão

connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'

# Criar conexão com o create_engine()
engine = create_engine(connection_string)

# Escrever consulta SQL

query_alunos = "SELECT * FROM aluno"

# Criar DataFrame

df_alunos = pd.read_sql(query_alunos, engine)

# Mostrar 5 primeiros
df_alunos.head()

    id        ra  nome  tempo_de_estudo  renda_media_familia
0  114  00034548  None              NaN                  NaN
1  115  00034549  None              NaN                  NaN
2  116  00034547  None              NaN                  NaN
3  117  00034546  None              NaN                  NaN
4  118  00034550  None              NaN                  NaN

#### Quais a bibliotecas um cientista de dados utiliza?
- Pandas;
- NumPy;
- Fundamentos de IA (Scikit-learn)

#### Material didático
- Pandas e NumPy (Notebook)
- Scikit-Learn (Apostila do SENAI)

##### Pandas: ciência de dados
##### Scikit-Learn: elaboração de modelos de IA
##### NumPy: Matemática

05/08/2024

- Carregar dados (ok)

- Salvar um dataframe

In [4]:
csv_file = 'alunos.csv'
df_alunos.to_csv(csv_file, index=False) # Precisa desses dois paramêtros

# Exercício - Salve o DataFrame no formato JSON

In [5]:
json_file = 'alunos.json'
df_alunos.to_json(json_file, index=False)

In [6]:
excel_file = 'planilha_alunos.xlsx'
df_alunos.to_excel(excel_file, index=False)

In [7]:
df_alunos.columns

Index(['id', 'ra', 'nome', 'tempo_de_estudo', 'renda_media_familia'], dtype='object')

In [8]:
df_tempo_renda = df_alunos[['tempo_de_estudo', 'renda_media_familia']]
df_tempo_renda

     tempo_de_estudo  renda_media_familia
0                NaN                  NaN
1                NaN                  NaN
2                NaN                  NaN
3                NaN                  NaN
4                NaN                  NaN
..               ...                  ...
101            495.0            1300000.0
102            505.0            1320000.0
103            515.0            1340000.0
104            525.0            1360000.0
105            535.0            1380000.0

[106 rows x 2 columns]

# Revisando funções básicas

## 06/08/2024
- Exercício 01 - Retorne o dataframe da última aula com as duas primeiras linhas como amostras.

In [9]:
df_tempo_renda.head(2)
# df_tempo_renda[:2]

   tempo_de_estudo  renda_media_familia
0              NaN                  NaN
1              NaN                  NaN

- Exercício 02 - Retorne o dataframe da última aula com as duas últimas linhas como amostras.

In [10]:
df_tempo_renda.tail(2)

     tempo_de_estudo  renda_media_familia
104            525.0            1360000.0
105            535.0            1380000.0

- Exercício 03 - Retorne uma tupla com o número de linhas e colunas.

In [11]:
df_tempo_renda.shape # Retorna a tupla

(106, 2)

- Exercício 04 - Retorne as informações gerais do dataframe.

In [12]:
df_tempo_renda.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 106 entries, 0 to 105
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   tempo_de_estudo      52 non-null     float64
 1   renda_media_familia  52 non-null     float64
dtypes: float64(2)
memory usage: 1.8 KB

In [13]:
qtd = len(df_tempo_renda)
if qtd <= 106:
    print(f'Quantidade: {qtd} dentro do ideal')

Quantidade: 106 dentro do ideal

- Exercício 05 - Retorne as colunas.

In [14]:
df_tempo_renda.columns

Index(['tempo_de_estudo', 'renda_media_familia'], dtype='object')

- Exercício 06 - Retorne as informações apenas da coluna renda familiar.

In [15]:
df_tempo_renda['renda_media_familia'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 106 entries, 0 to 105
Series name: renda_media_familia
Non-Null Count  Dtype
--------------  -----
52 non-null     float64
dtypes: float64(1)
memory usage: 980.0 bytes

- Exercício 07 - Mostre os tipos com dtypes

In [16]:
df_alunos.dtypes

id                       int64
ra                      object
nome                    object
tempo_de_estudo        float64
renda_media_familia    float64
dtype: object

- Estatística

In [17]:
df_alunos.describe() # Faz um resumo, contagem, média, minimo, etc.

               id  tempo_de_estudo  renda_media_familia
count  106.000000        52.000000         5.200000e+01
mean   166.500000       285.596154         8.621538e+05
std     30.743563       144.807683         3.262689e+05
min    114.000000        10.000000         2.000000e+03
25%    140.250000       153.750000         6.150000e+05
50%    166.500000       280.000000         8.700000e+05
75%    192.750000       407.500000         1.125000e+06
max    219.000000       535.000000         1.380000e+06

- Exercício 08 - Crie u dataframe da tabela diário de bordo e mostre os valores.

In [18]:
query_diario = "SELECT * FROM diariobordo"
query_avaliacao = "SELECT * FROM avaliacao"

df_diario = pd.read_sql(query_diario, engine)
df_avaliacao = pd.read_sql(query_avaliacao, engine)

In [19]:
df_diario.head() # Lê os 5 primeiros campos da tabela

,id,texto,datahora,fk_aluno_id
0,120,"Hoje estamos aprendendo MySql, comandos como U...",2024-07-31 15:47:50,150
1,121,Hoje tivemos uma segunda aula sobre banco de d...,2024-07-31 17:45:00,167
2,122,Aula sobre dataframe É importante!,2024-08-06 15:47:50,151
3,123,Aula de revisao do pandas É importante!,2024-08-06 15:43:00,152
4,124,Aula de revisao do SQL!,2024-08-06 16:00:00,153

In [20]:
df_avaliacao.shape # Retorna uma tupla com a qtd de linhas e colunas

(47, 6)

In [21]:
df_avaliacao.columns

Index(['id', 'nota2', 'nota1', 'nota3', 'nota4', 'fk_aluno_id'], dtype='object')

In [22]:
df_avaliacao.describe()

              id      nota2      nota1      nota3      nota4  fk_aluno_id
count  47.000000  47.000000  47.000000  47.000000  47.000000    47.000000
mean   29.000000  21.297872  18.680851  22.042553  24.234043   165.659574
std    13.711309   1.196279   1.770610   1.062349   0.839585    15.956839
min     6.000000  20.000000  16.000000  20.000000  21.000000   120.000000
25%    17.500000  20.000000  17.000000  22.000000  24.000000   166.000000
50%    29.000000  21.000000  19.000000  22.000000  24.000000   169.000000
75%    40.500000  22.000000  20.000000  23.000000  25.000000   174.000000
max    52.000000  25.000000  25.000000  25.000000  25.000000   179.000000

In [23]:
df_avaliacao.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47 entries, 0 to 46
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           47 non-null     int64
 1   nota2        47 non-null     int64
 2   nota1        47 non-null     int64
 3   nota3        47 non-null     int64
 4   nota4        47 non-null     int64
 5   fk_aluno_id  47 non-null     int64
dtypes: int64(6)
memory usage: 2.3 KB

### Gerando um arquivo EXCEL

In [24]:
alunos_excel = 'planilha_avaliacao.xlsx' # cria a variavel e de um nome pra sua planilha com a extensão
df_avaliacao.to_excel(alunos_excel, index=False) # Passe 2 parametros

- Exercício 09 - Faça um join no pandas similar ao do SQL.

# Fazendo um join

In [25]:
len(df_diario)

25

In [26]:
len(df_alunos)

106

In [28]:
df_diario[0:26]

,id,texto,datahora,fk_aluno_id
0,120,"Hoje estamos aprendendo MySql, comandos como U...",2024-07-31 15:47:50,150
1,121,Hoje tivemos uma segunda aula sobre banco de d...,2024-07-31 17:45:00,167
2,122,Aula sobre dataframe É importante!,2024-08-06 15:47:50,151
3,123,Aula de revisao do pandas É importante!,2024-08-06 15:43:00,152
4,124,Aula de revisao do SQL!,2024-08-06 16:00:00,153
5,125,Hoje praticamos SQL com ênfase em funções de a...,2024-08-01 09:30:00,172
6,126,Fizemos exercícios sobre normalização de banco...,2024-08-02 14:00:00,165
7,127,Aprendemos sobre índices e como eles afetam a ...,2024-08-03 16:15:00,178
8,128,Estudamos as diferenças entre tipos de joins e...,2024-08-04 11:00:00,170
9,129,Realizamos um projeto de grupo para criar um b...,2024-08-05 13:45:00,169
10,130,Revisamos os conceitos de transações e control...,2024-08-06 10:00:00,174
11,131,Analisamos casos de estudo sobre escalabilidad...,2024-08-07 15:30:00,166
12,132,Fizemos uma revisão geral dos comandos DDL e D...,2024-08-08 12:00:00,171
13,133,Discutimos estratégias para backup e recuperaç...,2024-08-10 16:00:00,162
14,134,Trabalhamos em exercícios sobre segurança e co...,2024-08-11 09:45:00,175
15,135,Estudamos a estrutura de tabelas e tipos de da...,2024-08-12 13:00:00,168
16,136,Realizamos uma análise de desempenho em consul...,2024-08-13 11:15:00,179
17,137,Fizemos uma introdução ao MySQL Workbench e su...,2024-08-14 10:30:00,177
18,138,Praticamos a criação e a manipulação de views ...,2024-08-15 15:00:00,163
19,139,Exploramos os conceitos de datatypes e como es...,2024-08-16 12:30:00,172
20,140,Realizamos uma atividade prática para otimizaç...,2024-08-17 14:00:00,169
21,141,Discutimos sobre a importância dos planos de e...,2024-08-18 10:15:00,174
22,142,Fizemos exercícios sobre a criação de relatóri...,2024-08-19 13:45:00,167
23,143,Revisamos o conceito de integridade referencia...,2024-08-20 09:00:00,170
24,144,Exploramos técnicas avançadas de gerenciamento...,2024-08-21 16:30:00,179

### Passos para o merge
- Use o comando merge;
- Criar uma variável - resultado;
- pd.merge(dataframe1, datafreme2) - queremos juntar, (tipo_uniao, chave da esquerda, chave da direita); 
- Qual o tipo de união: how='inner';
- O parâmetro how define o tipo de join que estamos realizando;
- inner significa que queremos um join interno, o que resulta em apenas as linhas que têm correspondência em ambos os DataFrames.

In [30]:
resultado = pd.merge(df_diario, df_alunos, how='left', left_on='fk_aluno_id', right_on='id')
resultado

,id_x,texto,datahora,fk_aluno_id,id_y,ra,nome,tempo_de_estudo,renda_media_familia
0,120,"Hoje estamos aprendendo MySql, comandos como U...",2024-07-31 15:47:50,150,150,00034582,None,NaN,NaN
1,121,Hoje tivemos uma segunda aula sobre banco de d...,2024-07-31 17:45:00,167,167,00118544,None,NaN,NaN
2,122,Aula sobre dataframe É importante!,2024-08-06 15:47:50,151,151,00034583,None,NaN,NaN
3,123,Aula de revisao do pandas É importante!,2024-08-06 15:43:00,152,152,00034584,None,NaN,NaN
4,124,Aula de revisao do SQL!,2024-08-06 16:00:00,153,153,00034585,None,NaN,NaN
5,125,Hoje praticamos SQL com ênfase em funções de a...,2024-08-01 09:30:00,172,172,00034603,Carla Oliveira Lima,100.0,450000.0
6,126,Fizemos exercícios sobre normalização de banco...,2024-08-02 14:00:00,165,165,00034597,None,NaN,NaN
7,127,Aprendemos sobre índices e como eles afetam a ...,2024-08-03 16:15:00,178,178,00034609,Isabela Fernandes Lima,125.0,540000.0
8,128,Estudamos as diferenças entre tipos de joins e...,2024-08-04 11:00:00,170,170,00034601,Ana Caroline Rodrigues,120.0,500000.0
9,129,Realizamos um projeto de grupo para criar um b...,2024-08-05 13:45:00,169,169,00034600,Andre Rodrigues,11.0,10000.0
10,130,Revisamos os conceitos de transações e control...,2024-08-06 10:00:00,174,174,00034605,Eva Martins Ferreira,110.0,470000.0
11,131,Analisamos casos de estudo sobre escalabilidad...,2024-08-07 15:30:00,166,166,00034598,None,NaN,NaN
12,132,Fizemos uma revisão geral dos comandos DDL e D...,2024-08-08 12:00:00,171,171,00034602,Bruno Santos Silva,150.0,600000.0
13,133,Discutimos estratégias para backup e recuperaç...,2024-08-10 16:00:00,162,162,00034594,None,NaN,NaN
14,134,Trabalhamos em exercícios sobre segurança e co...,2024-08-11 09:45:00,175,175,00034606,Felipe Souza Gomes,140.0,490000.0
15,135,Estudamos a estrutura de tabelas e tipos de da...,2024-08-12 13:00:00,168,168,00034599,Wanderson Rodrigues,10.0,2000.0
16,136,Realizamos uma análise de desempenho em consul...,2024-08-13 11:15:00,179,179,00034610,João Pedro Silva,135.0,580000.0
17,137,Fizemos uma introdução ao MySQL Workbench e su...,2024-08-14 10:30:00,177,177,00034608,Henrique Lima Rocha,115.0,530000.0
18,138,Praticamos a criação e a manipulação de views ...,2024-08-15 15:00:00,163,163,00034595,None,NaN,NaN
19,139,Exploramos os conceitos de datatypes e como es...,2024-08-16 12:30:00,172,172,00034603,Carla Oliveira Lima,100.0,450000.0
20,140,Realizamos uma atividade prática para otimizaç...,2024-08-17 14:00:00,169,169,00034600,Andre Rodrigues,11.0,10000.0
21,141,Discutimos sobre a importância dos planos de e...,2024-08-18 10:15:00,174,174,00034605,Eva Martins Ferreira,110.0,470000.0
22,142,Fizemos exercícios sobre a criação de relatóri...,2024-08-19 13:45:00,167,167,00118544,None,NaN,NaN
23,143,Revisamos o conceito de integridade referencia...,2024-08-20 09:00:00,170,170,00034601,Ana Caroline Rodrigues,120.0,500000.0
24,144,Exploramos técnicas avançadas de gerenciamento...,2024-08-21 16:30:00,179,179,00034610,João Pedro Silva,135.0,580000.0

### Pesquiso quais colunas eu quero mostrar

In [31]:
resultado_selecionado = resultado[['nome','ra', 'texto']]
resultado_selecionado

,nome,ra,texto
0,None,00034582,"Hoje estamos aprendendo MySql, comandos como U..."
1,None,00118544,Hoje tivemos uma segunda aula sobre banco de d...
2,None,00034583,Aula sobre dataframe É importante!
3,None,00034584,Aula de revisao do pandas É importante!
4,None,00034585,Aula de revisao do SQL!
5,Carla Oliveira Lima,00034603,Hoje praticamos SQL com ênfase em funções de a...
6,None,00034597,Fizemos exercícios sobre normalização de banco...
7,Isabela Fernandes Lima,00034609,Aprendemos sobre índices e como eles afetam a ...
8,Ana Caroline Rodrigues,00034601,Estudamos as diferenças entre tipos de joins e...
9,Andre Rodrigues,00034600,Realizamos um projeto de grupo para criar um b...
10,Eva Martins Ferreira,00034605,Revisamos os conceitos de transações e control...
11,None,00034598,Analisamos casos de estudo sobre escalabilidad...
12,Bruno Santos Silva,00034602,Fizemos uma revisão geral dos comandos DDL e D...
13,None,00034594,Discutimos estratégias para backup e recuperaç...
14,Felipe Souza Gomes,00034606,Trabalhamos em exercícios sobre segurança e co...
15,Wanderson Rodrigues,00034599,Estudamos a estrutura de tabelas e tipos de da...
16,João Pedro Silva,00034610,Realizamos uma análise de desempenho em consul...
17,Henrique Lima Rocha,00034608,Fizemos uma introdução ao MySQL Workbench e su...
18,None,00034595,Praticamos a criação e a manipulação de views ...
19,Carla Oliveira Lima,00034603,Exploramos os conceitos de datatypes e como es...
20,Andre Rodrigues,00034600,Realizamos uma atividade prática para otimizaç...
21,Eva Martins Ferreira,00034605,Discutimos sobre a importância dos planos de e...
22,None,00118544,Fizemos exercícios sobre a criação de relatóri...
23,Ana Caroline Rodrigues,00034601,Revisamos o conceito de integridade referencia...
24,João Pedro Silva,00034610,Exploramos técnicas avançadas de gerenciamento...

- Exercício 10 - Crie uma junção do dataframe aluno com avaliação. Mostre as notas e o RA do aluno.

In [34]:
resultado2 = pd.merge(df_avaliacao, df_alunos, how='left', left_on='fk_aluno_id', right_on='id')
resultado2.head(5)

,id_x,nota2,nota1,nota3,nota4,fk_aluno_id,id_y,ra,nome,tempo_de_estudo,renda_media_familia
0,6,22,20,25,25,120,120,00034552,None,NaN,NaN
1,7,20,22,23,24,121,121,00034553,None,NaN,NaN
2,8,22,20,22,21,122,122,00034554,None,NaN,NaN
3,9,25,25,25,25,123,123,00034555,None,NaN,NaN
4,10,22,20,20,25,124,124,00034556,None,NaN,NaN

In [36]:
resultado_selecionado2 = resultado2[['ra', 'nota1', 'nota2', 'nota3', 'nota4']]
resultado_selecionado2.head(10)

         ra  nota1  nota2  nota3  nota4
0  00034552     20     22     25     25
1  00034553     22     20     23     24
2  00034554     20     22     22     21
3  00034555     25     25     25     25
4  00034556     20     22     20     25
5  00034603     18     20     22     25
6  00034597     16     20     21     23
7  00034609     19     21     23     24
8  00034601     20     22     20     25
9  00034600     17     23     22     24